# StairsRunTopElevation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsRunTopElevation Property
ParameterTypeId Class See Also
---
"Relative Top Height": Top height of run
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsRunTopElevation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsRunTopElevation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsRunTopElevation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace